balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F5011E.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2RX1B3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C2RX1B3" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB1D4" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB1D4" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB1D5" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB1D5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB1D40" edc:desc="" edc:mask="0x1" edc:name="TXB1D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D41" edc:desc="" edc:mask="0x1" edc:name="TXB1D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D42" edc:desc="" edc:mask="0x1" edc:name="TXB1D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D43" edc:desc="" edc:mask="0x1" edc:name="TXB1D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D44" edc:desc="" edc:mask="0x1" edc:name="TXB1D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D45" edc:desc="" edc:mask="0x1" edc:name="TXB1D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D46" edc:desc="" edc:mask="0x1" edc:name="TXB1D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D47" edc:desc="" edc:mask="0x1" edc:name="TXB1D47" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D50" edc:desc="" edc:mask="0x1" edc:name="TXB1D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D51" edc:desc="" edc:mask="0x1" edc:name="TXB1D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D52" edc:desc="" edc:mask="0x1" edc:name="TXB1D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D53" edc:desc="" edc:mask="0x1" edc:name="TXB1D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D54" edc:desc="" edc:mask="0x1" edc:name="TXB1D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D55" edc:desc="" edc:mask="0x1" edc:name="TXB1D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D56" edc:desc="" edc:mask="0x1" edc:name="TXB1D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D57" edc:desc="" edc:mask="0x1" edc:name="TXB1D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2RX1B4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C2RX1B4" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB1D6" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB1D6" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB1D7" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB1D7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB1D60" edc:desc="" edc:mask="0x1" edc:name="TXB1D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D61" edc:desc="" edc:mask="0x1" edc:name="TXB1D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D62" edc:desc="" edc:mask="0x1" edc:name="TXB1D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D63" edc:desc="" edc:mask="0x1" edc:name="TXB1D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D64" edc:desc="" edc:mask="0x1" edc:name="TXB1D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D65" edc:desc="" edc:mask="0x1" edc:name="TXB1D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D66" edc:desc="" edc:mask="0x1" edc:name="TXB1D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D67" edc:desc="" edc:mask="0x1" edc:name="TXB1D67" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D70" edc:desc="" edc:mask="0x1" edc:name="TXB1D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D71" edc:desc="" edc:mask="0x1" edc:name="TXB1D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D72" edc:desc="" edc:mask="0x1" edc:name="TXB1D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D73" edc:desc="" edc:mask="0x1" edc:name="TXB1D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D74" edc:desc="" edc:mask="0x1" edc:name="TXB1D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D75" edc:desc="" edc:mask="0x1" edc:name="TXB1D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D76" edc:desc="" edc:mask="0x1" edc:name="TXB1D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D77" edc:desc="" edc:mask="0x1" edc:name="TXB1D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------c---rrrr" edc:cname="C2RX1CON" edc:desc="" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------0---0000" edc:name="C2RX1CON" edc:nzwidth="0x10" edc:por="--------0---0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT" edc:desc="" edc:mask="0x7" edc:name="FILHIT" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnnnnnnnnnn" edc:cname="C2RX0SID" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuuuuuuuuuu" edc:name="C2RX0SID" edc:nzwidth="0x10" edc:por="uuuxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXIDE" edc:desc="" edc:mask="0x1" edc:name="RXIDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x1" edc:name="SID" edc:nzwidth="0xB"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnnnnnnnnnn" edc:cname="C2RX0EID" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu" edc:name="C2RX0EID" edc:nzwidth="0x10" edc:por="----xxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
