balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F5011E.PIC
        <edc:SFRDef edc:access="nnnnnnnn---nnnnn" edc:cname="C2RX0DLC" edc:desc="" edc:impl="0xff1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu" edc:name="C2RX0DLC" edc:nzwidth="0x10" edc:por="xxxxxxxx---xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC" edc:desc="" edc:mask="0xf" edc:name="DLC" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="RXRB0" edc:desc="" edc:mask="0x1" edc:name="RXRB0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RXRB1" edc:desc="" edc:mask="0x1" edc:name="RXRB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0xA"/>
              <edc:SFRFieldDef edc:cname="EID5_0" edc:desc="" edc:mask="0x1" edc:name="EID5_0" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2RX0B1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C2RX0B1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D0" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D0" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB0D1" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0D00" edc:desc="" edc:mask="0x1" edc:name="TXB0D00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D01" edc:desc="" edc:mask="0x1" edc:name="TXB0D01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D02" edc:desc="" edc:mask="0x1" edc:name="TXB0D02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D03" edc:desc="" edc:mask="0x1" edc:name="TXB0D03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D04" edc:desc="" edc:mask="0x1" edc:name="TXB0D04" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D05" edc:desc="" edc:mask="0x1" edc:name="TXB0D05" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D06" edc:desc="" edc:mask="0x1" edc:name="TXB0D06" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D07" edc:desc="" edc:mask="0x1" edc:name="TXB0D07" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D10" edc:desc="" edc:mask="0x1" edc:name="TXB0D10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D11" edc:desc="" edc:mask="0x1" edc:name="TXB0D11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D12" edc:desc="" edc:mask="0x1" edc:name="TXB0D12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D13" edc:desc="" edc:mask="0x1" edc:name="TXB0D13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D14" edc:desc="" edc:mask="0x1" edc:name="TXB0D14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D15" edc:desc="" edc:mask="0x1" edc:name="TXB0D15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D16" edc:desc="" edc:mask="0x1" edc:name="TXB0D16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D17" edc:desc="" edc:mask="0x1" edc:name="TXB0D17" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2RX0B2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C2RX0B2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D2" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB0D3" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0D20" edc:desc="" edc:mask="0x1" edc:name="TXB0D20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D21" edc:desc="" edc:mask="0x1" edc:name="TXB0D21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D22" edc:desc="" edc:mask="0x1" edc:name="TXB0D22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D23" edc:desc="" edc:mask="0x1" edc:name="TXB0D23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D24" edc:desc="" edc:mask="0x1" edc:name="TXB0D24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D25" edc:desc="" edc:mask="0x1" edc:name="TXB0D25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D26" edc:desc="" edc:mask="0x1" edc:name="TXB0D26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D27" edc:desc="" edc:mask="0x1" edc:name="TXB0D27" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D30" edc:desc="" edc:mask="0x1" edc:name="TXB0D30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D31" edc:desc="" edc:mask="0x1" edc:name="TXB0D31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D32" edc:desc="" edc:mask="0x1" edc:name="TXB0D32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D33" edc:desc="" edc:mask="0x1" edc:name="TXB0D33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D34" edc:desc="" edc:mask="0x1" edc:name="TXB0D34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D35" edc:desc="" edc:mask="0x1" edc:name="TXB0D35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D36" edc:desc="" edc:mask="0x1" edc:name="TXB0D36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D37" edc:desc="" edc:mask="0x1" edc:name="TXB0D37" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
